{"papers":[{"citationKey":"LI-ETAL-2017-DAILYDIALOG","entryType":"INPROCEEDINGS","entryTags":{"TITLE":"{D}aily{D}ialog: A Manually Labelled Multi-turn Dialogue Dataset","AUTHOR":"Li, Yanran  and      Su, Hui  and      Shen, Xiaoyu  and      Li, Wenjie  and      Cao, Ziqiang  and      Niu, Shuzi","BOOKTITLE":"Proceedings of the Eighth International Joint Conference on Natural Language Processing (Volume 1: Long Papers)","MONTH":"November","YEAR":"2017","ADDRESS":"Taipei, Taiwan","PUBLISHER":"Asian Federation of Natural Language Processing","URL":"https://aclanthology.org/I17-1099","PAGES":"986--995","ABSTRACT":"We develop a high-quality multi-turn dialog dataset, \\textbf{DailyDialog}, which is intriguing in several aspects. The language is human-written and less noisy. The dialogues in the dataset reflect our daily communication way and cover various topics about our daily life. We also manually label the developed dataset with communication intention and emotion information. Then, we evaluate existing approaches on DailyDialog dataset and hope it benefit the research field of dialog systems. The dataset is available on \\url{http://yanran.li/dailydialog}","url":"https://www.semanticscholar.org/paper/3108f96f80d129036f53684344f4058257b37c4b"}},{"citationKey":"CHAWLA-ETAL-2021-CASINO","entryType":"INPROCEEDINGS","entryTags":{"TITLE":"{C}a{S}i{N}o: A Corpus of Campsite Negotiation Dialogues for Automatic Negotiation Systems","AUTHOR":"Chawla, Kushal  and      Ramirez, Jaysa  and      Clever, Rene  and      Lucas, Gale  and      May, Jonathan  and      Gratch, Jonathan","BOOKTITLE":"Proceedings of the 2021 Conference of the North American Chapter of the Association for Computational Linguistics: Human Language Technologies","MONTH":"June","YEAR":"2021","ADDRESS":"Online","PUBLISHER":"Association for Computational Linguistics","URL":"https://aclanthology.org/2021.naacl-main.254","DOI":"10.18653/v1/2021.naacl-main.254","PAGES":"3167--3185","ABSTRACT":"Automated systems that negotiate with humans have broad applications in pedagogy and conversational AI. To advance the development of practical negotiation systems, we present CaSiNo: a novel corpus of over a thousand negotiation dialogues in English. Participants take the role of campsite neighbors and negotiate for food, water, and firewood packages for their upcoming trip. Our design results in diverse and linguistically rich negotiations while maintaining a tractable, closed-domain environment. Inspired by the literature in human-human negotiations, we annotate persuasion strategies and perform correlation analysis to understand how the dialogue behaviors are associated with the negotiation performance. We further propose and evaluate a multi-task framework to recognize these strategies in a given utterance. We find that multi-task learning substantially improves the performance for all strategy labels, especially for the ones that are the most skewed. We release the dataset, annotations, and the code to propel future work in human-machine negotiations: https://github.com/kushalchawla/CaSiNo","url":"https://www.semanticscholar.org/paper/37607828cb9b8ae5011bbcc8ecc2e159f719347c"}},{"citationKey":"ZHOU2022REFLECT","entryType":"INPROCEEDINGS","entryTags":{"TITLE":"Reflect Not Reflex: Inference-Based Common Ground Improves Dialogue Response Quality","AUTHOR":"Zhou, Pei and Cho, Hyundong J. and Jandaghi, Pegah and Lee, Dong-Ho and Lin, Bill Yuchen and Pujara, Jay and Ren, Xiang","BOOKTITLE":"Proceedings of the 2022 Conference on Empirical Methods in Natural Language Processing","YEAR":"2022","url":"https://www.semanticscholar.org/paper/ddbbf78334ef65d412520236e5d9067c82ef8984"}},{"citationKey":"ZAHIRI2017EMOTIONDO","entryType":"ARTICLE","entryTags":{"TITLE":"Emotion Detection on TV Show Transcripts with Sequence-based Convolutional Neural Networks","AUTHOR":"Sayyed M. Zahiri and Jinho D. Choi","JOURNAL":"ArXiv","YEAR":"2017","VOLUME":"abs/1708.04299","url":"https://www.semanticscholar.org/paper/9ea51567b3b19c9e71f4e62a2e77b1bdb4c3693c"}},{"citationKey":"RASHKIN2018TOWARDSEO","entryType":"INPROCEEDINGS","entryTags":{"TITLE":"Towards Empathetic Open-domain Conversation Models: A New Benchmark and Dataset","AUTHOR":"Hannah Rashkin and Eric Michael Smith and Margaret Li and Y-Lan Boureau","BOOKTITLE":"Annual Meeting of the Association for Computational Linguistics","YEAR":"2018","url":"https://www.semanticscholar.org/paper/a33a06ddc762fb855b6954c08d5aca603080b011"}},{"citationKey":"ZHANG2018PERSONALIZINGDA","entryType":"INPROCEEDINGS","entryTags":{"TITLE":"Personalizing Dialogue Agents: I have a dog, do you have pets too?","AUTHOR":"Saizheng Zhang and Emily Dinan and Jack Urbanek and Arthur D. Szlam and Douwe Kiela and Jason Weston","BOOKTITLE":"Annual Meeting of the Association for Computational Linguistics","YEAR":"2018","url":"https://www.semanticscholar.org/paper/6c7046195f64cccac1ed3275d88d77655534b5a4"}},{"citationKey":"RASHKIN2018IKT","entryType":"ARTICLE","entryTags":{"TITLE":"I Know the Feeling: Learning to Converse with Empathy","AUTHOR":"Hannah Rashkin and Eric Michael Smith and Margaret Li and Y-Lan Boureau","JOURNAL":"ArXiv","YEAR":"2018","VOLUME":"abs/1811.00207","url":"https://www.semanticscholar.org/paper/f7e9d6d6ae95d78506f3eb0963ec97c5cc873055"}},{"citationKey":"SAI2020IMPROVINGDE","entryType":"ARTICLE","entryTags":{"TITLE":"Improving Dialog Evaluation with a Multi-reference Adversarial Dataset and Large Scale Pretraining","AUTHOR":"Ananya B. Sai and Akash Kumar Mohankumar and Siddharth Arora and Mitesh M. Khapra","JOURNAL":"Transactions of the Association for Computational Linguistics","YEAR":"2020","VOLUME":"8","PAGES":"810-827","url":"https://www.semanticscholar.org/paper/a279efc0938433e5e81a085f1a614b5817d3435c"}},{"citationKey":"GHOSAL2021CIDERCI","entryType":"INPROCEEDINGS","entryTags":{"TITLE":"CIDER: Commonsense Inference for Dialogue Explanation and Reasoning","AUTHOR":"Deepanway Ghosal and Pengfei Hong and Siqi Shen and Navonil Majumder and Rada Mihalcea and Soujanya Poria","BOOKTITLE":"SIGDIAL Conferences","YEAR":"2021","url":"https://www.semanticscholar.org/paper/a8debd8f58ee690005d996d223c37239e25273ec"}},{"citationKey":"SUN2019DREAMAC","entryType":"ARTICLE","entryTags":{"TITLE":"DREAM: A Challenge Data Set and Models for Dialogue-Based Reading Comprehension","AUTHOR":"Kai Sun and Dian Yu and Jianshu Chen and Dong Yu and Yejin Choi and Claire Cardie","JOURNAL":"Transactions of the Association for Computational Linguistics","YEAR":"2019","VOLUME":"7","PAGES":"217-231","url":"https://www.semanticscholar.org/paper/6ff68b34a5f78bdd14437fe5a79aebbc42c26467"}}]}